tangleDocs/emacs.org
*** Fonts
#+begin_src emacs-lisp :tangle no
;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))
#+end_src

*** Custom settings file
#+begin_src emacs-lisp
(setq custom-file (expand-file-name ".custom.el" doom-private-dir))
(when (file-exists-p custom-file) (load custom-file))
#+end_src

*** Theming
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
;; Themes
(package! dracula-theme)
(package! theme-magic)
#+end_src

There are two ways to load a theme. Both assume the theme is installed and available. You can either set `doom-theme' or manually load a theme with the `load-theme' function.
#+begin_src emacs-lisp
(setq doom-theme (if (display-graphic-p)'doom-one 'doom-dracula))
#+end_src

*** Line numbering
#+begin_src emacs-lisp
;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type t)
#+end_src

*** Undo
#+begin_src emacs-lisp
;; Let the undo buffer use up to 100Mb
(setq undo-limit 100000000)
#+end_src

*** Windows
#+begin_src emacs-lisp
;; Resize all windows when a new one comes in so they have
;; equal space.
(setq-default window-combination-resize t
;; changes the cursor to be the size of a gliph in the buffer.
              x-stretch-cursor t)

;; (setq-default left-margin-width 1)
;; (set-window-buffer nil (current-buffer))
#+end_src

*** Clipboard
Prevents system clipboard from being accidentally overwritten. Must now write to register "+ to write to system clipboard.
#+begin_src emacs-lisp
;; Some paste related settings.
(setq save-interprogram-paste-before-kill t
      select-enable-clipboard nil)
#+end_src

In order to provide copy and paste functionality directly from the keyboard, I need to capture the inputs and make functions that force the register that corresponds with the clipboard to be used (the + register).

First, I need to set up the wrapper functions. The thing to note is that these are just copies of the underlying function's header but they pass in the register's ascii number. In order to get the ascii number of a character, we simply need to put a '?' before it.
#+begin_src emacs-lisp
(evil-define-operator evil-copy-to-clipboard (beg end &optional type _ handler)
  "Saves the characters in motion into they system clipboard through the '+' register"
  :move-point nil
  :repeat nil
  (interactive "<R><x><y>")
  (evil-yank beg end type ?+ handler))
#+end_src

And here is the paste function.
#+begin_src emacs-lisp
(evil-define-command evil-paste-from-clipboard
  (count &optional _ handler)
  "Pastes the latest yanked text behind point.
The return value is the yanked text."
  :suppress-operator t
  (interactive "*P<x>")
  (evil-paste-before count ?+ handler))
#+end_src

Finally we need to create universal keybindings to these functions so they can be called from anywhere.
#+begin_src emacs-lisp
(map! :desc "Paste from clipboard" :nvieomg "s-v" #'evil-paste-from-clipboard
      :desc "Copy to clipboard"    :nvieomg "s-c" #'evil-copy-to-clipboard)
#+end_src

*** Scrolling
#+begin_src emacs-lisp
;; leave some space at the bottom while scrolling down so the
;; cursor isn't hugging the bottom edge.
(setq scroll-margin 2)
#+end_src

*** Scratch buffer
The scratch buffer is always present as an area to experiment or take a quick note without it needing to be a part of a file. In doom, this scratch buffer has a default mode of Fundamental which is both useless and not something I need for experimentation. In fact, I think it's meant for just writing text and notes. I want the scratch buffer to be a place to write some elisp code so I can set things on a whim while working in other non-elisp buffers.
#+begin_src emacs-lisp
(setq initial-major-mode 'emacs-lisp-mode)

(setq initial-scratch-message "\
;; Welcome to the scratch buffer.

")
#+end_src

*** Directory navigation
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
;; directory management
(package! dired-sidebar)
(package! dired+)
(package! dired-subtree)
#+end_src

#+begin_src emacs-lisp
(defun dired-turn-off-file-info ()
  "Turns off the file info in dired mode"
  (interactive)
  (dired-hide-details-mode t))
(add-hook! 'dired-mode-hook #'dired-turn-off-file-info)

(map! :map dired-mode-map
      :leader
      :desc "toggle dired file info"
      :n "t d" #'dired-hide-details-mode)
#+end_src

** Adding standard vim functionality
I don't remember why I wrote this line in the first place but it seems useful for later
#+begin_src emacs-lisp
(defun smart-open-line-above ()
  "Insert an empty line above the current line.
Position the cursor at it's beginning, according to the current mode."
  (interactive)
  (move-beginning-of-line nil)
  (newline-and-indent)
  (forward-line -1)
  (indent-according-to-mode))
#+end_src

*** Keybindings
**** Tab as fold toggling
When available, I really like to use tab as a quick way to toggle folds.
#+begin_src emacs-lisp
(map! :n "TAB" #'+fold/toggle)
#+end_src

** Managing files
*** Sidebar file explorer

Import a simpler sidebar package for when it's needed.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! dired-sidebar)
#+end_src

Dired is just so useful that I can't really justify using treemacs. Especially since treemacs has this annoying habit of not saving the location of my cursor so I have to start at the top every time...
#+begin_src emacs-lisp
(map! :n "C-n" #'dired-sidebar-toggle-sidebar)
(map! :n "M-n" #'+treemacs/toggle)
#+end_src

#+begin_src emacs-lisp :tangle no
(map! :n "C-n" #'+treemacs/toggle)
(map! :n "M-n" #'dired-sidebar-toggle-sidebar)
#+end_src

Make it so that treemacs closes itself when selected no matter which button I press.
#+begin_src emacs-lisp
(map! :map 'treemacs-mode-map
      :ng "M-n" #'+treemacs/toggle
      :ng "C-n" #'+treemacs/toggle)
#+end_src

**** Settings for sidebars
When a directory contains nothing but a single other directory, this collapses them into a single action to open and close. In treemacs I'm not making new files very often so this option makes sense.
The number represents the number of recursive layers it's allowed. Don't make it too big otherwise things could freeze up.
#+begin_src emacs-lisp
(setq treemacs-collapse-dirs 5)
#+end_src

*** Projectile
#+begin_src emacs-lisp
(after! projectile
  (setq projectile-track-known-projects-automatically nil))
#+end_src

*** Tree viewer
This allows you to see all the recursive files in the current tree hierarchy (similar to the ~tree~ command).
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! dirtree)
(package! ztree)
(package! dir-treeview)
#+end_src

*** Buffer handling
**** Perspectives
Currently doom emacs is using ~persp-mode~ which is a fork of ~perspective~. This section is for setting the variables that are related to those modes.

#+begin_src emacs-lisp
(setq persp-sort 'created)
#+end_src

**** Tab bar mode
A tab bar for emacs. It works quite well except it reads from global buffers instead of perspective restricted buffers so I have it turned off for now.
#+begin_src emacs-lisp no
(setq tab-bar-show t)
(setq tab-bar-tab-name-function #'tab-bar-tab-name-current)
(setq tab-bar-format '(tab-bar-format-tabs tab-bar-separator tab-bar-format-align-right tab-bar-format-global))
(set-face-attribute 'tab-bar nil :inherit 'tab-bar-tab :foreground nil :background nil)
(map! :n "M->" #'tab-next
      :n "M-<" #'tab-previous)
#+end_src

Add the menu button to the tab bar so it can be accessed once in a while without taking up space.
#+begin_src emacs-lisp
(defun tab-bar-format-menu-bar-lambda ()
  "Produce the Menu button for the tab bar that shows the menu bar."
  '((menu-bar menu-item (propertize " λ" 'face 'doom-modeline-evil-emacs-state)
     tab-bar-menu-bar :help "Menu Bar")))
(add-to-list 'tab-bar-format #'tab-bar-format-menu-bar-lambda)
#+end_src

Add global keybinding labeling so tabs are easier to find
#+begin_src emacs-lisp
(which-key-add-key-based-replacements "C-x t" "tabs")
#+end_src

Make tab functions accessible from the doom-leader menu as well.
#+begin_src emacs-lisp
(map! :leader :desc "Tabs" "T" tab-prefix-map)
#+end_src

*** Window zooming
One thing I really like about tmux is the ability to zoom in on windows without destroying my whole windowing setup. This package adds that same functionality to emacs.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! zoom-window)
#+end_src

#+begin_src emacs-lisp
(setq zoom-window-use-persp t)

(setq zoom-window-mode-line-color "DarkGreen")
(map! :leader
      :desc "Zoom window"
      "z" #'zoom-window-zoom)
#+end_src


** General utility package settings
These aren't file or use case specific changes but instead things that can apply over many different major modes and situations.

*** Sub-word movement
#+begin_src emacs-lisp
;; Makes it so movement keys stop at camlecase sub words.
(global-subword-mode 1)
#+end_src

*** Case insensitive search
=case-fold-search= is a variable that turns case sensitivity on and off. It is set per buffer. Since I like case sensitivity, I'm setting the default value so that new buffers use case sensitive searches.
#+begin_src emacs-lisp
;; Make searches case sensitive
(setq-default case-fold-search nil)
#+end_src

*** Key discovery
**** Which key
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! discover-my-major)
#+end_src

#+begin_src emacs-lisp
(map! :n "g /"   #'which-key-show-top-level
      :n "g C-/" #'which-key-show-full-major-mode
      :n "g ?"   #'which-key-show-full-major-mode
      :n "g M-/" #'which-key-show-minor-mode-keymap)
(setq which-key-idle-delay 0.5)
#+end_src

**** Embark
Embark is a package that allows you to search through key bindings and is a good supplement to which-key.

In order to use embark, we first need to add a dependency: marginalia.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! marginalia)
#+end_src

Then it just needs to be turned on. Since marginalia is fairly light, this (hopefully) shouldn't impact startup times.
#+begin_src emacs-lisp
(marginalia-mode)
#+end_src

Then for the main package itself, embark.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! embark)
#+end_src

Once embark is installed, there are some key-bindings that should be set. The first of which is replacing the describe bindings function because that one isn't the most helpful. However, I want to keep it around since once in a while it may prove useful.
#+begin_src emacs-lisp
(map! :map help-map
      "b b" 'embark-bindings
      "b B" 'describe-bindings)
#+end_src

*** Write good mode
#+begin_src emacs-lisp
(remove-hook! (org-mode markdown-mode rst-mode asciidoc-mode latex-mode) #'writegood-mode)
(add-hook 'writegood-mode-hook 'writegood-passive-voice-turn-off)
(map! :leader
      :desc "Write good mode"
      "t W" #'writegood-mode)
#+end_src

*** Flycheck mode
#+begin_src emacs-lisp
;; Disable flycheck mode on load. Can be re-enabled in a buffer with SPC t f
(remove-hook! (doom-first-buffer) #'global-flycheck-mode)
#+end_src

*** Evil mode
