tangleDocs/emacs.org
**** Evil settings
#+begin_src emacs-lisp
;; Make undo revert smaller sections of text instead of all text
;; added while in insert mode.
(setq evil-want-fine-undo t)
#+end_src

**** Evil snipe mode
***** Snipe mode off by default
I get really annoyed by snipe mode since I often use 's' for deleting text. Therefore I use the workaround below to turn off evil snipe mode by default since I really don't want it.
#+begin_src emacs-lisp
; Remove default snipe mode
(remove-hook! (doom-first-input) 'evil-snipe-mode)
; There can be problems between snipe mode and magit mode.
(add-hook 'magit-mode-hook 'turn-off-evil-snipe-override-mode)
#+end_src

***** Settings
Some settings for when snipe mode is on.
#+begin_src emacs-lisp
(setq evil-snipe-scope 'whole-visible
      evil-snipe-repeat-scope 'whole-visible)
#+end_src

***** New keybinding
This allows you to toggle evil snipe mode on and off (though it's still off by default)
#+begin_src emacs-lisp
(defun toggle-and-activate-evil-snipe-mode ()
  "Toggles evil-snipe-mode on and off then activates the
mode map since otherwise it requires forcing the normal mode state to be activated."
  (interactive)
  (evil-snipe-local-mode)
  (evil-force-normal-state))

(map! :leader
      :desc "Evil snipe mode"
      "t S" #'toggle-and-activate-evil-snipe-mode)
#+end_src

*** Snippets
Yas snippets are a nice package for inserting snippets into code.

Turning off the trigger in field for now since it was giving me undesired behavior. Maybe when I learn to use it better then it will come back into the config.
#+begin_src emacs-lisp :tangle no
(setq yas-triggers-in-field t)
#+end_src

*** VLF (Very Large Files)
VLF if a package for lazy loading enormous files that would normally take forever to load. The package needs to be first added but disabled so that it doesn't hamper load times. This formula was pulled from [[https://tecosaur.github.io/emacs-config/config.html#very-large-files][this]] legendary config.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
;; [[file:~/.config/doom/config.org::*Very large files][Very large files:1]]
(package! vlf :recipe (:host github :repo "m00natic/vlfi"))
#+end_src

Then setup the package later.
#+begin_src emacs-lisp
(use-package! vlf-setup
  :defer-incrementally vlf-tune vlf-base vlf-write vlf-search vlf-occur vlf-follow vlf-ediff vlf)
#+end_src

*** Colored info
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! info-colors)
#+end_src

#+begin_src emacs-lisp
(use-package! info-colors
  :commands (info-colors-fontify-node))
(add-hook 'info-selection-hook 'info-colors-fontify-node)
#+end_src

*** R data frames
This allows emacs to handle R style data frames. This makes some data handling easier in various files.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! ess-view)
#+end_src

*** Dictionary
#+begin_src emacs-lisp
;; Set the correct dictionary for spell check.
(setq ispell-dictionary "en")
#+end_src

*** Code folding
Origami mode
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! origami)
#+end_src

#+begin_src emacs-lisp
(global-origami-mode)
#+end_src

*** Git
**** Blamer
This module adds git commit information in line with code when turned on which can be nice when working through a code base.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! blamer)
#+end_src

#+begin_src emacs-lisp
(use-package blamer
  :defer 20
  :custom
  (blamer-idle-time 0)
  (blamer-min-offset 70)
  :custom-face
  (blamer-face ((t :foreground "#7a88cf"
                   :background nil
                   :height 140
                   :italic t))))
#+end_src
**** Diff
This is a nice package for visualizing git diffs in a more standard unix way than magit.
#+begin_src elisp :tangle ../configs/.doom.d/packages.el
(package! diff-ansi :recipe (:host gitlab :repo "ideasman42/emacs-diff-ansi"))
#+end_src

** Independent or external programs
*** Discord integration
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! elcord)
#+end_src

*** Speed reading
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! spray)
#+end_src

*** Presentations
**** Key cast
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! keycast)
#+end_src

#+begin_src emacs-lisp
(use-package! keycast
  :commands keycast-mode
  :config
  (define-minor-mode keycast-mode
    "Show current command and its key bining in the mode line."
    :global t
    (if keycast-mode
        (progn
          (add-hook 'pre-command-hook 'keycast--update t)
          (add-to-list 'global-mode-string '("" mode-line-keycast " ")))
      (remove-hook 'pre-command-hook 'keycast--update)
      (setq global-mode-string (remove '("" mode-line-keycast " ") global-mode-string))))
  (custom-set-faces!
    ('keycast-command :inherit doom-modeline-debug :height 0.9)
    ('keycast-key :inherit custom-modified :height 1.1 :weight bold)))
#+end_src

**** Gif Screenshot
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! gif-screencast)
#+end_src

#+begin_src emacs-lisp
(use-package! gif-screencast
  :commands gif-screencast-mode
  :config
  (map! :map gif-screencast-mode-map
        :g "<f8>" #'gif-screencast-toggle-pause
        :g "<f9>" #'gif-screencast-stop)
  (setq gif-screencast-program "maim"
        gif-screencast-args '("--quality" "3" "-1" ,(string-trim-right (shell-command-to-string "xdotool getactivewindow")))
        gif-screencast-optimize-args '("--batch" "--optimize=3" "--usecolormap=/tmp/doom-color-theme"))
  (defun gif-screencast-write-colormap ()
    (f-write-text
     (replace-regexp-in-string "\n+" "\n"
                               (mapconcat (lambda (c) (if (listp (cdr c))) (cadr c)))
                               'utf-8
                               "/tmp/doom-color-theme")))
  (gif-screencast-write-colormap)
  (add-hook 'doom-load-theme-hook #'gif-screencast-write-colormap))
#+end_src

**** Command log mode
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! command-log-mode)
#+end_src

*** Kubernetes
Kubernetes is a container program that is useful for managing container networks.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! kubernetes)
(package! kubernetes-evil)
#+end_src

This is for working with kubernetes config files.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! k8s-mode)
#+end_src

And being able to work with helm is a must for kubernetes.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! kubernetes-helm)
#+end_src

** Mode/package settings
*** Guix
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! guix)
#+end_src

*** Elisp-shell
#+begin_src emacs-lisp
(setq eshell-aliases-file "~/.doom.d/.eshell-aliases")
#+end_src

**** Elisp shell aliases
#+begin_src emacs-lisp :tangle ../configs/.doom.d/.eshell-aliases
#+end_src

*** Mode line
Adds details to the emacs mode line at the bottom of the page. Although several of the values can be referenced elsewhere on a given page, seeing them there is often just convenient and it uses space that would otherwise go unused.

**** Date and time
#+begin_src emacs-lisp
;; Add useful data to the mode line.
(setq display-time-day-and-date t)
(display-time-mode 1)
#+end_src

**** Battery
For the battery, I don't want it to appear in the the mode line if there is no battery present.

Since the following functions require the battery package, I need to wrap it in ~use-package~ to make sure all the definitions are loaded.
#+begin_src emacs-lisp
(use-package! battery :config
#+end_src

Sadly, there are no default functions for finding if a battery is present so I'll start by writing my own based off of the ~battery~ function in [[https://github.com/emacs-mirror/emacs/blob/3af9e84ff59811734dcbb5d55e04e1fdb7051e77/lisp/battery.el#L219][battery.el]].
#+begin_src emacs-lisp
    (defun battery-p ()
        "returns t if a battery is present for the system and nil if one is not."
        (and battery-status-function
             battery-echo-area-format
             (string-match-p "^Power N/A"
                             (battery-format
                                     battery-echo-area-format
                                     (funcall battery-status-function)))
             t))
#+end_src

If a battery source is detected, then show the batter level in the mode bar.
#+begin_src emacs-lisp
    (unless (battery-p) (display-battery-mode 1))
#+end_src

Finally, close the battery package wrapper.
#+begin_src emacs-lisp
)
#+end_src

**** Encoding format
#+begin_src emacs-lisp
(defun doom-modeline-conditional-buffer-encoding ()
  "We expect the encoding to be LF UTF-8,
so only show the modeline when this is not the case"
  (setq-local doom-modeline-buffer-encoding
              (if (and
                       ; Checking for UTF-8
                       (memq
                        (plist-get (coding-system-plist buffer-file-coding-system) :category)
                        '(coding-category-utf-8))
                       ; Checking for LF line ending
                       (not
                        (memq (coding-system-eol-type buffer-file-coding-system) '(1 2))))
                t nil)))
(add-hook 'after-change-major-mode-hook #'doom-modeline-conditional-buffer-encoding)
#+end_src

*** Web mode
#+begin_src emacs-lisp
(setq web-mode-script-padding standard-indent)
(setq web-mode-style-padding standard-indent)
(setq web-mode-block-padding standard-indent)
(setq web-mode-part-padding standard-indent)
#+end_src

*** Org mode
**** Org add-on packages
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! org-reverse-datetree)
;(package! ox-gfm) ; Causing problems with pandoc at the moment.
(package! org-ref)
(package! org-chef)
(package! org-super-agenda)
(package! org-fragtog)
(package! org-pretty-tags)
#+end_src

**** Standard Org settings
If you use `org' and don't want your org files in the default location below, change `org-directory'. It must be set before org loads!
#+begin_src emacs-lisp
(setq org-directory "~/org")
(setq org-archive-location "archive/%s_archive::")
#+end_src

***** Font support
In org mode I like to be able to write in different fonts and languages (such as chinese) so I'm turning on variable pitch font support. Without it, lots of text starts to overlap.
#+begin_src emacs-lisp :tangle no
(add-hook 'org-mode-hook #'chinese-text-support)
#+end_src

***** Babel
Several languages require LSPs or other back end code to be configured for babel to use them so they are configured here.

****** Clojure
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
;; Clojure related packages
(package! clojure-mode)
(package! clojure-mode-extra-font-locking)
(package! clj-refactor)
(package! cider)
#+end_src

#+begin_src emacs-lisp
(setq org-bable-clojure-backend 'cider)
#+end_src

