tangleDocs/emacs.org
***** Org mode keybindings
#+begin_src emacs-lisp
;; Use keybinding g b to "go back" to previous location when a link is followed.
;; Use keybinding g m to "go mark" the current location so it can be returned to later.
(map! :after org
    :map org-mode-map
    :n  "g m" #'org-mark-ring-push
    :n  "g b" #'org-mark-ring-goto
    :nv "g j" #'evil-next-visual-line
    :nv "g k" #'evil-previous-visual-line
    :nv "g J" #'org-forward-element
    :nv "g K" #'org-backward-element)
#+end_src

***** Shortcut to open org files
This shortcut opens the org directory and allows a user to select a file. If the file doesn't yet exist then it is created. This is useful when I want to open some information on something that I've been tracking but don't have another shortcut to it saved somewhere.

This first function opens up the a file with all the complications that come with opening the file including setting a correct extension if needed.
#+begin_src emacs-lisp
(setq org-default-extension ".org")
(defun org-open-org-file (file)
  "Opens an org file in the default org folder.
if no org extension is given then it will be automatically appended."
  (interactive
   (list (directory-file-name
          (read-file-name "Choose org file:" org-directory))))

  ; Check for if the file:
  ; * Already exists (and is not a directory)
  ; * Has an org extension
  ; If neither of these cases is valid then automatically append an org extension
  ; to the provided file name.
  (let ((input-file-extension (concat "." (file-name-extension file)))
        (valid-org-extension-regex-list
         (mapcar 'car
                 (seq-filter
                  (lambda (mode-pairs) (eq 'org-mode (cdr mode-pairs)))
                  auto-mode-alist))))
    (unless
        (or (and (file-exists-p file)
                 (not (file-directory-p file)))
            (and input-file-extension
                 ; check the input
                 (eval (cons 'or (mapcar (lambda (extension-regex)
                                           (string-match-p extension-regex input-file-extension))
                                         valid-org-extension-regex-list)))))
      (setq file (concat file org-default-extension)))) ; Otherwise set file to have an org extension)

  ; If, after the above checks, the file name still points to a directory, then
  ; throw an error since it can't be opened at that point.
  (if (file-directory-p file)
      (error "The provided file is a directory %s" file)
    (find-file file)
    (org-mode)))
#+end_src

This helper function contains the shared code for prompting for a file.
=TODO= Create a function for building a system path.
#+begin_src emacs-lisp
(defun prompt-org-file (&optional dir default-name)
  "Prompts the user for a file inside the specified directory. Uses defualt name when no entry is given if the name is provided."
  (unless dir (setq dir org-directory))
  (directory-file-name (read-file-name "Choose org file: " dir default-name)))
#+end_src

Finally we can create functions to each of the directories that I access most often and map them to key cords.
#+begin_src emacs-lisp
(defun org-open-file ()
  "Prompts and opens a file in the default org directory."
  (interactive)
  (org-open-org-file (prompt-org-file org-directory "notes.org")))

(defun open-work-org-file (directory default-file)
  "A condensing function for opening an org directory for work purposes"
  (org-open-org-file (prompt-org-file (concat (file-name-as-directory org-directory) (file-name-as-directory "work") (file-name-as-directory directory)) default-file)))

(defun org-open-work-note ()
  "Prompts and opens a file in the org work notes directory."
  (interactive)
  (open-work-org-file "notes" "notes.org"))

(defun org-open-project-note ()
  "Prompts and opens a file in the org work notes directory."
  (interactive)
  (open-work-org-file "projects" "project.org"))

(defun org-open-work-task ()
  "Prompts and opens a file in the org work tasks directory."
  (interactive)
  (open-work-org-file "tasks" "schedule.org"))

(defun org-open-work-wiki ()
  "Prompts and opens a file in the org work tasks directory."
  (interactive)
  (open-work-org-file "wiki" "toSort.org"))

(map! :leader
      (:prefix ("f o" . "Org files")
       :desc "Org file" "o" #'org-open-file
       (:prefix ("w" . "Work")
        :desc "Notes" "n" #'org-open-work-note
        :desc "Projects" "p" #'org-open-project-note
        :desc "Tasks" "t" #'org-open-work-task
        :desc "Wiki" "w" #'org-open-work-wiki)))
#+end_src

**** Org Roam
#+begin_src emacs-lisp
(setq org-roam-directory "~/roam")
(setq org-roam-v2-ack t)
#+end_src

**** Timers and clock
#+begin_src emacs-lisp
(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)
#+end_src

**** Org Agenda
***** Limiting files
To set specific files as being "agenda" files, you can use =org-agenda-files= however I've found I like putting schedule markers in various files around my org setup.
#+begin_src emacs-lisp :tangle no
(setq org-agenda-files (list "~/org/work.org"
                             "~/org/todo.org"))
#+end_src

**** Pomodoro
***** Begin "after! org"
All these settings have to be made after org loads so they're wrapped in an =(after! org ...)= macro.
#+begin_src emacs-lisp
(after! org
#+end_src

***** Work length
#+begin_src emacs-lisp
(setq org-pomodoro-length 25
    org-pomodoro-short-break-length 5
    org-pomodoro-long-break-length 15)
#+end_src

***** Sounds to play
#+begin_src emacs-lisp
(setq org-pomodoro-play-sounds t
    ;; org-pomodoro-start-sound-p f
    ;; org-pomodoro-ticking-sound-p f
    org-pomodoro-killed-sound-p t
    org-pomodoro-finished-sound-p t
    org-pomodoro-short-break-sound-p t
    org-pomodoro-long-break-sound-p t)
#+end_src

***** Sounds to use
If I decide to find sound files I like more than the defaults, then I can put them here.
#+begin_src emacs-lisp :tangle no
(setq ;org-pomodoro-start-sound ()
      ;org-pomodoro-ticking-sound ()
      org-pomodoro-killed-sound ()
      org-pomodoro-finished-sound ()
      org-pomodoro-short-break-sound ()
      org-pomodoro-long-break-sound ())
#+end_src

***** End of "after! org"
#+begin_src emacs-lisp
)
#+end_src

**** Org Capture
***** Settings
#+begin_src emacs-lisp
; Set default file for newly captured notes
(after! org (setq org-default-notes-file (concat org-directory "/inbox.org")))
#+end_src

***** Org template
All of my org templates are in a separate folder in my org files repo. This is so that templates are both private from public eyes and also travel with their partnered org files. I'll probably make a separate git repo for them just so they're recorded but that's a lower priority.

Load templates from org directory.
#+begin_src emacs-lisp
(defun load-directory (dir)
  "Loads all .el files from a provided directory. If the directory doesn't exist, the function loads nothing."
  (interactive)
  (if (not (file-directory-p dir))
      (message "No directory named %s, no scripts loaded." dir)
    (let* ((load-it (lambda (f)
                      (load-file (concat (file-name-as-directory dir) f)))
                    ))
      (mapc load-it (directory-files dir nil "\\.el$")))))

(load-directory (concat (file-name-as-directory org-directory) "capture-templates"))
#+end_src

****** Example template code
Example of org capture templates and how everything is setup.
pulled from https://github.com/hlissner/doom-emacs/blob/develop/modules/lang/org/config.el.
This block isn't tangled and isn't at all guaranteed to work even if it was so use it only as an example.
#+begin_src emacs-lisp :tangle no
(after! org
  (setq org-capture-templates '(
    ("t" "Todo" entry () "" :prepend t)
    ("k" "Kudos" entry () "" :prepend t)
    ("f" "Followup" entry () "" :prepend t)
    ("p" "Personal" entry () "" :prepend t)
    ("P" "Project" entry () "" :prepend t)
    ("j" "Journal" entry () "" :prepend t)
  )))
'(
  ("t" "Personal todo" entry (file+headline +org-capture-todo-file "Inbox") "* [ ] %?\n%i\n%a" :prepend t)
          ("n" "Personal notes" entry (file+headline +org-capture-notes-file "Inbox") "* %u %?\n%i\n%a" :prepend t)
          ("j" "Journal" entry (file+olp+datetree +org-capture-journal-file)
           "* %U %?\n%i\n%a" :prepend t)

          ;; Will use {project-root}/{todo,notes,changelog}.org, unless a
          ;; {todo,notes,changelog}.org file is found in a parent directory.
          ;; Uses the basename from `+org-capture-todo-file',
          ;; `+org-capture-changelog-file' and `+org-capture-notes-file'.
          ("p" "Templates for projects")
          ("pt" "Project-local todo" entry  ; {project-root}/todo.org
           (file+headline +org-capture-project-todo-file "Inbox")
           "* TODO %?\n%i\n%a" :prepend t)
          ("pn" "Project-local notes" entry  ; {project-root}/notes.org
           (file+headline +org-capture-project-notes-file "Inbox")
           "* %U %?\n%i\n%a" :prepend t)
          ("pc" "Project-local changelog" entry  ; {project-root}/changelog.org
           (file+headline +org-capture-project-changelog-file "Unreleased")
           "* %U %?\n%i\n%a" :prepend t)

          ;; Will use {org-directory}/{+org-capture-projects-file} and store
          ;; these under {ProjectName}/{Tasks,Notes,Changelog} headings. They
          ;; support `:parents' to specify what headings to put them under, e.g.
          ;; :parents ("Projects")
          ("o" "Centralized templates for projects")
          ("ot" "Project todo" entry
           (function +org-capture-central-project-todo-file)
           "* TODO %?\n %i\n %a"
           :heading "Tasks"
           :prepend nil)
          ("on" "Project notes" entry
           (function +org-capture-central-project-notes-file)
           "* %U %?\n %i\n %a"
           :heading "Notes"
           :prepend t)
          ("oc" "Project changelog" entry
           (function +org-capture-central-project-changelog-file)
           "* %U %?\n %i\n %a"
           :heading "Changelog"
           :prepend t))
#+end_src

**** Org Chef
Org chef is a package for saving cooking recipes from sites like [[https://www.allrecipes.com][allrecipies]] in org mode for future reference and use.
#+begin_src emacs-lisp
(use-package! org-chef
  :commands (org-chef-insert-recipe org-chef-get-recipe-from-url))
#+end_src

*** Systemd
*** E-book reader
**** Packages
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
;; e-reader
(package! calibredb)
(package! nov)
#+end_src

