tangleDocs/emacs.org
**** Settings
#+begin_src emacs-lisp
(use-package! nov ; Novel reading
  :mode ("\\.epub\\'" . nov-mode)
  :config
  (map! :map nov-mode-map
        :n "RET" #'nov-scroll-up)
  (defun doom-modeline-segment--nov-info ()
    (concat
     " " (propertize
          (cdr (assoc 'creator nov-metadata))
          'face
          'doom-modeline-project-parent-dir)
     " " (cdr (assoc 'title nov-metadata))
     " " (propertize
          (format "%d/%d" (1+ nov-documents-index) (length nov-documents))
          'face
          'doom-modeline-info)))
  (advice-add 'nov-render-title :override #'ignore)
  (defun +nov-mode-setup ()
    (require 'visual-fill-column nil t)
    (setq-local visual-fill-column-center-text t
                visual-fill-column-width 80
                nov-text-width 80)
    (visual-fill-column-mode 1)
    (hl-line-mode -1)
    (add-to-list '+lookup-definition-functions #'+lookup/dictionary-definition)

    (setq-local mode-line-format
                `((:eval (doom-modeline-segment--workspace-name))
                  (:eval (doom-modeline-segment--window-number))
                  (:eval (doom-modeline-segment--nov-info))
                  ,(propertize " "
                               'face (if (doom-modeline--active) 'mode-line 'mode-line-inactive)
                               'display `((space :align-to
                                                 (-
                                                  (+ right right-fringe right-margin)
                                                  ,(* (let ((width (doom-modeline --font-width)))
                                                        (or (and (= width 1) 1)
                                                            (/ width (frame-char-width) 1.0)))
                                                      (string-width
                                                       (format-mode-line
                                                        (cons ""
                                                              '(:eval (doom-modeline-segment--major-mode))))))))))
                  (:eval (doom-modeline-segment--major-mode)))))

  (add-hook 'nov-mode-hook #'+nov-mode-setup))
#+end_src

*** Programming Languages
**** Open CAD
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! scad-mode)
#+end_src

**** Go mode
Go mode is a mode for writing golang code. In order to get the mode to work properly, it requires some configuration. I found instructions for setting stuff on [[https://wmanger.com/articles/go-on-doom-emacs/][this]] blog and then adding ~gopls~ and ~golangci-lint~.

**** Javascript
When working with Javascript, I want to make sure that files fit the standard that I'm working with when I save them so I want to run eslint and/or prettier.

***** Eslint
Luckily eslint is can be used through LSP mode so for now the stuff below is unneeded.

First I need to be able to run eslint from Emacs.
#+begin_src elisp :tangle no
(defun eslint-fix-file (&optional filename)
  "Run eslint --fix on FILENAME"
  (if (executable-find "eslint")
      (progn
        (unless filename (setq filename (buffer-file-name)))
        (call-process-shell-command
         (concat "eslint --fix " filename)
         nil
         "*Shell Command Output*"
         t))))
#+end_src

Then I need to be able to reload my current file after eslint has run on it.
#+begin_src elisp :tangle no
(defun eslint-current-file ()
  "Run eslint on the current file and load the result"
  (interactive)
  (if (executable-find "eslint")
      (progn
        (message "Running eslint on " (buffer-file-name))
        (eslint-fix-file (buffer-file-name))
        (revert-buffer t t))))
#+end_src

Finally I need to be able to insert that into the save hook when the javascript mode is loaded.
#+begin_src elisp :tangle no
(defun run-eslint-on-save ()
  "Adds hook to run eslint on save"
  (interactive)
  (add-hook 'after-save-hook #'eslint-current-file))

(add-hook 'js2-mode-hook #'run-eslint-on-save)
#+end_src

***** Prettier
First I need to add prettier mode so that I don't need to write it myself.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! prettier-js)
#+end_src

Then I just add it to my javascript mode.
#+begin_src elisp :tangle no
(add-hook 'js2-mode-hook #'prettier-js-mode)
#+end_src

**** Gitlab CI
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! gitlab-ci-mode)
#+end_src

**** Vimrc
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! vimrc-mode)
#+end_src

**** Graphviz
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! graphviz-dot-mode)
#+end_src

#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! systemd)
#+end_src

**** General interpreter
***** TabNine
TabNine is a general purpose autocompleter. It uses Machine learning to find what's suggested to write next.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! company-tabnine)
#+end_src

** Fun
*** XKCD
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
;; Fun stuff
(package! xkcd)
#+end_src

*** Typewriter
Makes emacs sound like a typewriter.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! selectric-mode)
#+end_src

*** Games
**** steam
A package for accessing and organizing your steam library from within emacs
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! steam)
#+end_src

**** 2048-game
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! 2048-game)
#+end_src

**** mines
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! mines)
#+end_src

**** minesweeper
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! minesweeper)
#+end_src

**** sudoku
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! sudoku)
#+end_src

**** threes
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! threes)
#+end_src

**** Pacmacs
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! pacmacs)
#+end_src

**** Wordel
Wordel is a new little game that's a fun distraction.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! wordel :recipe (:host github :repo "progfolio/wordel"))
#+end_src

*** Fireplace
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! fireplace)
#+end_src

*** Power mode!
Power mode causes the screen to shake and dust to fly with each key that's typed. A cool effect for when you're hammering out a sarcastic reply.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(package! power-mode :recipe (:host github :repo "elizagamedev/power-mode.el"))
#+end_src

** Experimental personal functions
#+begin_src emacs-lisp
(defun print-point-position ()
  "Print the position of point to the message console."
  (interactive)
  (message (number-to-string (point))))

(map! :leader
      (:prefix-map ("a" . "Additional")
        (:desc "Point's position" "p" #'print-point-position)))
;;        (:prefix-map ("a" . "test2")
;;         (:prefix ("a" . "test")
;;          :desc "a test function to see if this works" "j" #'org-journal-new-entry
         ;; :desc "Search journal entry" "s" #'org-journal-search))))
;;
#+end_src

* Fixes
Here are some config fixes for issues I'm running into.

This issue is with some hook that is causing all my actions to fail its getting really annoying. I couldn't even use magit. Well now you're gone little guy, hope you're happy.
#+begin_src emacs-lisp
(remove-hook! '(magit-mode-hook find-file-hook) #'forge-bug-reference-setup)
#+end_src

This package's git github repo recently changed and so the pinning information is wrong. I'm unpinning it for now so that things build correctly. Eventually this will get fixed and can be removed. This isn't a big risk since this package is not under active development so the no breaking changes should come any time soon.
#+begin_src emacs-lisp :tangle ../configs/.doom.d/packages.el
(unpin! dired-git-info)
#+end_src

* Auto Tangle
The below allows this file to tangle and produce the output configuration files whenever the document is saved.

;; Local Variables:
;; eval: (add-hook 'after-save-hook (lambda () (org-babel-tangle)))
;; End:
